using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/*
    შექმენით გეომეტრიული ფიგურის Figura საბაზო კლასი, რომელშიც სამი დაცული
    გვერდია გამოცხადებული. განსაზღვრულია ასევე ორი კონსტრუქტორი. პირველ
    კონსტრუქტორს სამი პარამეტრი აქვს და ახდენს სამივე გვერდის ინიციალიზებას.
    მეორე კონსტრუქტორს ერთი პარამეტრი აქვს და ახდენს ერთი გვერდის
    ინიციალიზებას. შექმენით მისი მემკვიდრე Samkutxedi და Kvadrati კლასები.
    Samkutxedi კლასში გამოცხადებულია პრივატული ცვლადი - პერიმეტრი.
    Samkutxedi კლასის კონსტრუქტორი იძახებს წინაპარი კლასის კონსტრუქტორს
    გვერდების ზომების განსაზღვრის მიზნით. თვით ამ კონსტრუქტორში
    გამოითვლება სამკუთხედის პერიმეტრი. ამავე კლასის მეორე ღია მეთოდი
    გვიბრუნებს სამკუთხედის პერიმეტრს. Kvadrati კლასში გამოცხადებულია
    პრივატული ცვლადი - ფართობი. Kvadrati კლასის კონსტრუქტორი იძახებს
    წინაპარი კლასის კონსტრუქტორს გვერდის ზომის განსაზღვრის მიზნით. თვით
    ამ კონსტრუქტორში ხდება კვადრატის ფართობის გამოთვლა. ამავე კლასის მეორე
    ღია მეთოდი გვიბრუნებს კვადრატის ფართობს. მთავარ პროგრამაში შექმენით
    Samkutxedi და Kvadrati კლასის ტიპის მქონე ობიექტები და გამოიძახეთ
    მეთოდები
 */

namespace Quiz4 {
    internal class Figura {
        protected int side1, side2, side3;
        public Figura(int side1, int side2, int side3) {
            this.side1 = side1;
            this.side2 = side2;
            this.side3 = side3;
        }
        public Figura(int side1) { this.side1 = side1; }
    }
}
